"""
2)	Создайте словарь d = {'1': 0, ‘2’: 0, '3': 0}
тремя способами. Выведите полученный словарь на экран.
"""
#1 способ:
d_1 = {'1': 0, '2': 0, '3': 0}
print(d_1)
#2 способ:
d_2 = dict([('1', 0), ('2', 0), ('3', 0)])
print(d_2)
#3 способ:
d_3 = dict.fromkeys(['1','2','3'], 0)
print(d_3)
