#Дана длина ребра куба. Найти объем куба и площадь его боковой поверхности.
a = 5
V = (a**3) #вычисляем объем куба
S = (4*a**2) #вычисляем площадь боковой поверхности куба
print("Объем куба равен: " + str(V))
print("Площадь боковой поверхности куба равна: " + str(S))
