#Даны два действительных числа. Найти среднее арифметическое и среднее геометрическое этих чисел
a = 4
b = 6
result1 = ((a+b)/2)
print(a)
print(b)
print(" Среднее арифметическое значение чисел: " + str(a) + " и " + str(b) +" = " + str(result1))
result2 = (a*b)
import math #запускаем модуль для вычесления корня квадратного
num = result2
sqrt = math.sqrt(num)
print(" Среднее геометрическое значение чисел: " + str(a) + " и " + str (b) + " = " + str(sqrt))

