#Примените все математические операции, например +,-, **, % и т. д., к самой переменной
#Например
#x = 5
#x += 3
#print(x)

X = 5
X += 3 #сложение
print(X) #результат сложения
X -= 2 #вычетание
print(X) #результат вычетания
X *= 5 #умножение
print(X) #результат умножения
X /= 3 #деление
print(X) #результат деления
X **= 3 #возведение в степень
print(X) #результат возведения в степень
X //= 2 #целочисленное деление
print(X) #результат целочисленного деления
X %= 3 #вычисляем остаток от деления
print(X) #результат вычисления остатка от деления
