#Даны два действительных числа a и b. получить их сумму , разность и произведение
a = 2
b = 3
result1 = (a+b) #сложение
result2 = (a-b) #вычетание
result3 = (a*b) #умножение
print(result1) #результат сложения
print(result2) #результат вычитания
print(result3) #результат умножения